backend/controllers/TitulosController.php

SELECT * FROM `institucion`
SELECT * FROM `auth_assignment` WHERE `user_id`=1
---
    public function actionFirmarxml()
    {
        $instituciones = Institucion::find()->all();
        $rol = AuthAssignment::findOne(['user_id' => Yii::$app->user->getId()]);

SELECT * FROM `profesionista` WHERE `curp`='TETH620125HNTJPC09'
---
    public function actionDescargaxml()
    {
        $formulario = new FirmaTituloForm();
        if (Yii::$app->request->isPost) {
            $data = Yii::$app->request->post();
            $formulario->load($data);
            $alumnos = trim($formulario->alumnos,",");
            $arr_alumnos = explode(",", $alumnos);
            $nombre_zip = "";
            $test = false;
            if(isset($data['test']) && $data['test'] == 1){
                $test = true;
            }

            if(count($arr_alumnos) > 1 && $test == false){
                $zip = new \ZipArchive;
                $nombre_zip = 'xml/'.date("H:i:s").'_titulos.zip';
                if (!$zip->open($nombre_zip, \ZipArchive::CREATE) === TRUE){
                    \Yii::$app->session->setFlash('error', 'Error al crear zip');
                    return $this->redirect(['titulos/firmarxml']);
                }
            }
            foreach ($arr_alumnos as $key => $curp) {
                $profesionista = Profesionista::findOne(['curp' => $curp]);

SELECT * FROM `carrera` WHERE (`cveCarrera`='211310') AND (`cveInstitucion`='090225')
---
                    return $this->redirect(['titulos/firmarxml']);
                }
                if(!is_null($profesionista->cveInstitucion) && $profesionista->cveInstitucion != ""){
                    $carrera = Carrera::findOne(['cveCarrera' => $profesionista->cveCarrera,'cveInstitucion' => $profesionista->cveInstitucion]);

SELECT * FROM `institucion` WHERE `cveInstitucion`='090225'
---
                    \Yii::$app->session->setFlash('error', 'No existe la carrera del profesionista');
                    return $this->redirect(['titulos/firmarxml']);
                }
                $institucion = Institucion::findOne(['cveInstitucion' => $carrera->cveInstitucion]);

SELECT * FROM `responsables` WHERE `cveInstitucion`='090225'
---
                    \Yii::$app->session->setFlash('error', 'No existe las institución del profesionista');
                    return $this->redirect(['titulos/firmarxml']);
                }
                $responsables = Responsables::findAll(['cveInstitucion' => $institucion->cveInstitucion]);

SELECT * FROM `expedicion` WHERE `idExpedicion`='CVH14'
---
                    \Yii::$app->session->setFlash('error', 'No existen responsables para la institución');
                    return $this->redirect(['titulos/firmarxml']);
                }
                $expedicion = Expedicion::findOne(['idExpedicion' => $profesionista->idExpedicion]);

SELECT * FROM `antecedente` WHERE `folioControl`='003220'
---
                    \Yii::$app->session->setFlash('error', 'No existe el expedicion para el profesionista');
                    return $this->redirect(['titulos/firmarxml']);
                }
                $antecedente = Antecedente::findOne(['folioControl' => $profesionista->folioControl]);

SELECT * FROM `carrera` WHERE `cveInstitucion`='090225'
---
    public function actionBuscacarreras($id)
    {
        $carreras = Carrera::find()
            ->where(['cveInstitucion' => $id])
            ->asArray()
            ->all();

SELECT * FROM `profesionista` WHERE `cveCarrera`='211310'
---
    public function actionBuscaprofesionistas($id)
    {
        $profesionista = Profesionista::find()
            ->where(['cveCarrera' => $id])
            ->asArray()
            ->all();

SELECT * FROM `importaciones` WHERE `id`='120'
INSERT INTO `importaciones` (`importado`, `ruta_archivo`) VALUES (0, '/home1/certif17/public_html/titulos/backend/web/titulos/TF5_3scR4-5R4NiU0EyRKN-fH-O57Cxi.xlsx')
---
    public function actionGenerarxml()
    {
        $formulario = new GenerarXmlForm();
        $formulario->id_importacion = 0;
        $importacion = new Importaciones();
        $array_revision = [];
        if (Yii::$app->request->isPost) {
            $data = Yii::$app->request->post();
            $formulario->load($data);
            if( $formulario->id_importacion == 0){
                $formulario->archivo = UploadedFile::getInstance($formulario, 'archivo');
                $ruta_archivo = self::guarda($formulario->archivo);
            }else{
                $busca_importacion = Importaciones::findOne($formulario->id_importacion);
                $ruta_archivo = (!is_null($busca_importacion))?$busca_importacion->ruta_archivo:null;
            }

            if(!is_null($ruta_archivo) | $formulario->id_importacion > 0){
                ini_set('memory_limit', -1);
                ini_set('max_execution_time', 9000);
                date_default_timezone_set("America/Mexico_City");

                if($formulario->id_importacion == 0){
                    $importacion->importado = 0;
                    $importacion->ruta_archivo = $ruta_archivo;
                    $importacion->save(false);

INSERT INTO `institucion` (`cveInstitucion`, `nombreInstitucion`) VALUES ('090225', 'CENTRO DE ESTUDIOS DE LOS VALORES HUMANOS')
---
                        }

                        if(!$bandera_error){
                            Yii::$app->db->createCommand()->batchInsert(
                                'institucion',
                                $col_institucion,
                                $data_institucion
                            )->execute();

INSERT INTO `carrera` (`cveCarrera`, `nombreCarrera`, `idAutorizacionReconocimiento`, `autorizacionReconocimiento`, `numeroRvoe`, `cveInstitucion`) VALUES ('211310', 'LICENCIATURA EN TEOLOGÍA', '1', 'RVOE FEDERAL', '952129', '090225')
---
                        }

                        if(!$bandera_error){
                            Yii::$app->db->createCommand()->batchInsert(
                                'carrera',
                                $col_carrera,
                                $data_carrera
                            )->execute();

INSERT INTO `profesionista` (`curp`, `nombre`, `primerApellido`, `segundoApellido`, `correoElectronico`, `cveCarrera`, `folioControl`, `idExpedicion`, `fechaInicio`, `fechaTerminacion`, `cveInstitucion`) VALUES ('JECG900929MGRSRD00', 'GUDELIA', 'DE JESUS', 'CRUZ', 'secretaria@cevhac.mx', '211310', '003213', 'CVH7', '2016-01-01', '2019-01-01', '090225'), ('MATS840627MPLRLC02', 'SOCORRO', 'MARTINEZ', 'TOLEDANO', 'secretaria@cevhac.mx', '211310', '003214', 'CVH8', '2016-01-01', '2019-01-01', '090225'), ('OIDR790510MDFLRS05', 'ROSALINA', 'OLIVA', 'DURAN', 'secretaria@cevhac.mx', '211310', '003215', 'CVH9', '2016-01-01', '2019-01-01', '090225'), ('SOGF930917MDFTRL03', 'FLOR DEL CARMEN', 'SOTELO', 'GARCIA', 'secretaria@cevhac.mx', '211310', '003216', 'CVH10', '2014-01-01', '2019-01-01', '090225'), ('AAPM840103MOCLRR08', 'MIREYA', 'ALAVEZ', 'PEREZ', 'secretaria@cevhac.mx', '211310', '003217', 'CVH11', '2017-01-01', '2020-01-01', '090225'), ('CUPJ891028HSPRRN07', 'JUAN MANUEL', 'CRUZ', 'PEREZ', 'secretaria@cevhac.mx', '211310', '003218', 'CVH12', '2017-01-01', '2020-01-01', '090225'), ('MOSY871202MDFRND07', 'YADIRA', 'MORALES', 'SANCHEZ', 'secretaria@cevhac.mx', '211310', '003219', 'CVH13', '2017-01-01', '2020-01-01', '090225'), ('TETH620125HNTJPC09', 'HECTOR DAVID', 'TEJEDA', 'TAPIA', 'secretaria@cevhac.mx', '211310', '003220', 'CVH14', '2017-01-01', '2020-01-01', '090225')
---
                        }

                        if(!$bandera_error){
                            Yii::$app->db->createCommand()->batchInsert(
                                'profesionista',
                                $col_profesionista,
                                $data_profesionista
                            )->execute();

INSERT INTO `expedicion` (`idExpedicion`, `fechaExpedicion`, `idModalidadTitulacion`, `modalidadTitulacion`, `fechaExamenProfesional`, `fechaExencionExamenProfesional`, `cumplioServicioSocial`, `idFundamentoLegalServicioSocial`, `fundamentoLegalServicioSocial`, `idEntidadFederativa`, `entidadFederativa`) VALUES ('CVH7', '2020-03-01', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-02-21', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO'), ('CVH8', '2020-03-01', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-02-21', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO'), ('CVH9', '2020-03-01', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-02-21', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO'), ('CVH10', '2020-03-01', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-02-21', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO'), ('CVH11', '2021-01-15', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-12-22', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO'), ('CVH12', '2021-01-15', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-12-22', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO'), ('CVH13', '2021-01-15', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-12-22', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO'), ('CVH14', '2021-01-15', '3', 'POR ESTUDIOS DE POSGRADOS', '', '2020-12-22', '1', '2', 'ART. 55 LRART. 5 CONST', '09', 'CIUDAD DE MÉXICO')
---
                        }

                        if(!$bandera_error){
                            Yii::$app->db->createCommand()->batchInsert(
                                'expedicion',
                                $col_expedicion,
                                $data_expedicion
                            )->execute();

INSERT INTO `antecedente` (`institucionProcedencia`, `idTipoEstudioAntecedente`, `tipoEstudioAntecedente`, `idEntidadFederativa`, `entidadFederativa`, `fechaInicio`, `fechaTerminacion`, `noCedula`, `folioControl`) VALUES ('DIRECCIÓN GENERAL DEL BACHILLERATO', '4', 'BACHILLERATO', '17', 'MORELOS', NULL, '2009-07-17', '', '003213'), ('BACHILLERATO GENERAL HERIBERTO JARA CORONA', '4', 'BACHILLERATO', '21', 'PUEBLA', NULL, '2002-07-05', '', '003214'), ('CENTRO DE ESTUDIOS CIENTÍFICOS Y TECNOLÓGICOS JOSE MARIA MORELOS Y PAVON', '4', 'BACHILLERATO', '09', 'CIUDAD DE MÉXICO', NULL, '1999-07-05', '', '003215'), ('CENTRO DE ESTUDIOS CIENTÍFICOS TECNOLÓGICOS (CECyT) 2 MIGUEL BERNARD', '4', 'BACHILLERATO', '09', 'CIUDAD DE MÉXICO', NULL, '2012-06-27', '', '003216'), ('ESCUELA PREPARATORIA VESPERTINA VALLE NACIONAL INCORPORADA A LA UNIVERSIDAD AUTONÓMA BENITO JUAREZ DE OAXACA', '4', 'BACHILLERATO', '20', 'OAXACA', NULL, '2002-06-24', '', '003217'), ('COLEGIO DE BACHILLERES DE SAN LUIS POTOSÍ PLANTEL NO. 19 SAN LUIS II', '4', 'BACHILLERATO', '24', 'SAN LUIS POTOSÍ', NULL, '2008-06-27', '', '003218'), ('COLEGIO DE BACHILLERES PLANTEL NO. 18 TLILHUACA-AZCAPOTZALCO', '4', 'BACHILLERATO', '09', 'CIUDAD DE MÉXICO', NULL, '2006-05-12', '', '003219'), ('UNIVERSIDAD AUTONÓMA DE PUEBLA ESCUELA PREPARATORIA UAP', '5', 'EQUIVALENTE A BACHILLERATO', '21', 'PUEBLA', NULL, '1981-06-05', '', '003220')
---
                        }

                        if(!$bandera_error){
                            Yii::$app->db->createCommand()->batchInsert(
                                'antecedente',
                                $col_antecedentes,
                                $data_antecedentes
                            )->execute();

INSERT INTO `responsables` (`nombre`, `primerApellido`, `segundoApellido`, `curp`, `idCargo`, `cargo`, `abrTitulo`, `sello`, `certificadoResponsable`, `noCertificadoResponsable`, `cveInstitucion`) VALUES ('ARTURO', 'HEMAN', 'CONTRERAS', 'HECA510329HYNMNR02', '1', 'DIRECTOR', '', '', '', '00001000000408363765', '090781'), ('JUDITH', 'MATLA', 'FIGUEROA', 'MAFJ641028MDFTGD09', '5', 'RESPONSABLE DE EXPEDICIÓN', '', '', '', '00001000000413839295', '090781')
---
                        }

                        if(!$bandera_error){
                            Yii::$app->db->createCommand()->batchInsert(
                                'responsables',
                                $col_responsable1,
                                $data_responsables
                            )->execute();

SELECT * FROM `institucion`
SELECT * FROM `institucion` WHERE `cveInstitucion`='090781'
SELECT * FROM `carrera` WHERE `cveInstitucion`='090781'
SELECT * FROM `profesionista` WHERE `cveCarrera`='275530'
DELETE FROM `antecedente` WHERE `folioControl`='ITCC17'
DELETE FROM `expedicion` WHERE `idExpedicion`='CCI17'
DELETE FROM `responsables` WHERE `cveInstitucion`='090781'
DELETE FROM `institucion` WHERE `cveInstitucion`='090781'
---
    public function actionVaciartablas(){
        $instituciones = Institucion::find()->all();

        $busca_instituciones =  ArrayHelper::map(
            $instituciones,
            'cveInstitucion',
            'nombreInstitucion'
        );
        if (Yii::$app->request->isPost) {
            $data = Yii::$app->request->post();
            $password = ArrayHelper::getValue($data,'password', '');
            $instituciones = ArrayHelper::getValue($data,'institucion', []);
            if($password == "cpi2020*"){
                foreach ($instituciones as $i => $institucion) {
                    $busca_institucion = Institucion::findOne(['cveInstitucion' => $institucion]);
                    $busca_carreras = Carrera::findAll(['cveInstitucion' => $institucion]);
                    foreach ($busca_carreras as $c => $carrera) {
                        $busca_profesionista = Profesionista::findAll(['cveCarrera' => $carrera->cveCarrera]);
                        foreach ($busca_profesionista as $p => $profesionista) {
                            $elimina_antecedentes = Antecedente::deleteAll(['folioControl' => $profesionista->folioControl]);
                            $elimina_expedicion = Expedicion::deleteAll(['idExpedicion' => $profesionista->idExpedicion]);
                            $profesionista->delete();
                        }
                        $carrera->delete();
                    }
                    $elimina_responables = Responsables::deleteAll(['cveInstitucion' => $institucion]);
                    $busca_institucion->delete();

SELECT * FROM `institucion`
SELECT * FROM `auth_assignment` WHERE `user_id`=1
---
    public function actionEnviarsep(){
        $data_respuesta = [];
        $formulario = new EnviarTituloForm();
        $instituciones = Institucion::find()->all();
        $rol = AuthAssignment::findOne(['user_id' => Yii::$app->user->getId()]);

SELECT * FROM `titulos_ws` WHERE `id`='90'
---
    public function actionDescargarqa()
    {
       if (Yii::$app->request->isPost) {
            $data = Yii::$app->request->post();
            //print_r($data);die();
            $usuario_ws = ArrayHelper::getValue($data,"usuario_ws", '');
            $password_ws = ArrayHelper::getValue($data,"password_ws", '');
            $id_titulo = ArrayHelper::getValue($data,"id_titulo", '');
            $busca_titulo = TitulosWs::findOne($id_titulo);

SELECT * FROM `titulos_ws` WHERE `id`='91'
---
    public function actionDescargarprod()
    {
       if (Yii::$app->request->isPost) {
            $data = Yii::$app->request->post();
            //print_r($data);die();
            $usuario_ws = ArrayHelper::getValue($data,"usuario_ws", '');
            $password_ws = ArrayHelper::getValue($data,"password_ws", '');
            $id_titulo = ArrayHelper::getValue($data,"id_titulo", '');
            $busca_titulo = TitulosWs::findOne($id_titulo);